# essentials
brew 'git'
brew 'git-lfs'

# utils
brew 'ffmpeg'
brew 'htop'
brew 'rar'
brew 'ncdu'
brew 'thefuck'
brew 'wget'
brew 'zsh'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'jq'
brew 'bat'
brew 'ripgrep'
brew 'fswatch'
brew 'vim'
brew 'tmux'
brew 'universal-ctags'
brew 'rust'
brew 'monitorcontrol'

tap 'koekeishiya/formulae'
# brew 'yabai'
# brew 'skhd'
#cask 'alacritty'
cask 'kitty'

# software
brew 'gh'
cask 'macpass'
brew 'cmake'
brew 'clang-format'
cask "rectnagle"
