# essentials
brew 'git'
brew 'git-lfs'
brew 'neovim'
brew 'amethyst'

# utils
brew 'ffmpeg'
brew 'htop'
brew 'ncdu'
brew 'thefuck'
brew 'wget'
brew 'zsh'
brew 'coreutils'
brew 'jq'
brew 'bat'
brew 'ripgrep'
brew 'fswatch'
brew 'vim'
brew 'tmux'
brew 'universal-ctags'

tap 'koekeishiya/formulae'
# brew 'yabai'
# brew 'skhd'
#cask 'alacritty'
cask 'kitty'

# software
brew 'gh'
cask 'macpass'
brew 'cmake'
brew 'clang-format'
brew 'google-chrome'
brew 'dropbox'
brew 'spotify'
brew 'the-unarchiver'
brew 'iterm2'
brew 'jq'
brew 'curl'
brew 'wget'
brew 'visual-studio-code'
brew 'docker'
brew 'python'
brew 'slack'
